import { v4 as uuidv4 } from "uuid";

export const stressItems = [
  {
    id: uuidv4(),
    day: "روز اول",
    title: "قطع چرخه استرس",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2001.mp3?play",
    anchor: "من اینجام. کنترل با منه.",
    practices: {
      practice1:
        "سه موقعیت استرس‌زا بنویس (مثلاً جلسه دفاع، معرفی خودت، تماس تلفنی سخت)",
      practice2: "جلوی هرکدوم بنویس: «این فقط مغزمه… نه واقعیت»",
      practice3:
        "یه حرکت ساده جسمی انتخاب کن و هر بار که استرس اومد، انجامش بده (مثلاً فشردن انگشت شست و اشاره به‌مدت ۳ ثانیه)",
      practice4:
        "شب، بررسی کن که تونستی چرخه رو قطع کنی یا نه؟ و حس بدنت بعدش چی بود؟",
    },
    image: "../../public/images/stress-day1.png",
  },
  {
    id: uuidv4(),
    day: "روز دوم",
    title: "بازنویسی گفتگوی درونی",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2002.mp3?play",
    anchor: "من شنیده میشم چون ارزش گفت‌وگو دارم.",
    practices: {
      practice1: "بنویس: «آخرین بار که استرس گرفتم، صدای ذهنم چی گفت؟»",
      practice2:
        "بعدش بنویس: «اون جمله واقعاً بر پایه چه مدرکی بود؟» معمولاً هیچ مدرکی وجود نداره — فقط حسه",
      practice3:
        "حالا جایگزینش کن با یک جمله امن. می‌تونی از لیست من استفاده کنی یا خودت بسازی:",
      practice4:
        "لیست جملات امن پیشنهادی:\n • «این فقط یک موقعیته، نه تهدید واقعی»\n • «من دارم یاد می‌گیرم، نه اجرا می‌کنم»\n • «ترس علامته، نه حکم شکست»",
    },
    image: "../../public/images/stress-day2.png",
  },
  {
    id: uuidv4(),
    day: "روز سوم",
    title: "تنفس هدفمند ۴-۷-۸",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2003.mp3?play",
    anchor: "من انتخاب می‌کنم که آماده باشم.",
    practices: {
      practice1: "روزی ۲ بار، صبح و عصر، ۴ دور تنفس ۴-۷-۸ انجام بده",
      practice2: "زمان انجامش رو بنویس (صبح: ساعت ۱۰، عصر: ساعت ۱۸)",
      practice3:
        "بعدش، فقط یک جمله بنویس: حالت چه فرقی کرد؟ سردتر شدی؟ تپش کم شد؟ لرزش رفت؟",
      practice4:
        "و اگر شد، یک بار در موقعیت اجتماعی واقعی این تمرین رو تست کن (حتی فقط یک دور)",
    },
    image: "../../public/images/stress-day3.png",
  },
  {
    id: uuidv4(),
    day: "روز چهارم",
    title: "نقشه برداری از استرس اجتماعی",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2004.mp3?play",
    anchor: "صدای من یعنی حضور من.",
    practices: {
      practice1: "سه موقعیت پر استرس اجتماعی رو یادداشت کن",
      practice2: "کنار هر کدوم، بنویس: • مکان؟ • چه کسانی؟ • اتفاق کلیدی؟",
      practice3:
        "بعدش یه فلش بکش و بنویس: محرک اصلی چی بود؟ مثل: «جلسه کاری، مدیرم حضور داشت، وقتی گفت نظرت چیه؟»",
      practice4: "",
    },
    image: "../../public/images/stress-day4.png",
  },
  {
    id: uuidv4(),
    day: "روز پنجم",
    title: "مهار افکار آینده نگر و ترس از قضاوت",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2005.mp3?play",
    anchor: "من دیده و شنیده میشم.",
    practices: {
      practice1:
        "امروز سه بار که ذهنت رفت سراغ «آینده ترسناک»، همون لحظه یادداشت کن:\n • موضوع چی بود؟ (مثلاً حرف زدن، مصاحبه، جلسه، تماس تصویری)\n • ذهنت چی گفت؟ (جمله دقیق)\n • تو چی جواب دادی؟",
      practice2:
        "کنار هر مورد بنویس که تونستی از تکنیک سه مرحله‌ای استفاده کنی یا نه:",
      practice3:
        "\n۱. تشخیص فیلم ذهن\n۲. تغییر تمرکز به واقعیت (مثلاً تنفس، بدن)\n۳. گفتن جمله امن (مثل: «من اینجام. در حال یادگیری‌ام.»)",
      practice4: "",
    },
    image: "/images/stress-day5.png",
  },
  {
    id: uuidv4(),
    day: "روز ششم",
    title: "صداسازی ضد اضطراب: صدای تو، کنترل تو",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2006.mp3?play",
    anchor: "من آماده‌ام، بدنم هم با منه",
    practices: {
      practice1:
        "روزی ۲ بار تمرین تنفس + صدای “آه” + “اُمممم” + جملات متمرکز رو انجام بده",
      practice2:
        "یک بار در جمع واقعی (یا جلوی آینه/دوربین) صدای خودت رو ضبط کن",
      practice3:
        "به خودت گوش بده، و فقط یک چیز یادداشت کن:\n«آیا صدام با ترس شروع شد یا با حس انجام تمرین؟»",
      practice4:
        "ذهنیتی ایجاد کن که موقعیت‌های واقعی رو تمرین ببینی. ما بی‌نقص نیستیم، اما می‌تونیم نسخه تمرینی ۱۰۰٪ خودمون رو نشون بدیم.",
    },
    image: "/images/stress-day6.png",
  },
  {
    id: uuidv4(),
    day: "روز هفتم",
    title: "تثبیت مسیر جدید: لنگر آرامش و آینده امن",
    audioUrl: "https://s9.uupload.ir/files/saberzarei/Track%2007.mp3?play",
    anchor: "من این لحظه رو ساختم… من اینجام.",
    practices: {
      practice1:
        "یک موقعیت استرس‌زای واقعی آینده رو بنویس (مثلاً سخنرانی، کلاس، مصاحبه، حضور در جمع خانواده و ...)",
      practice2:
        "حالا صحنه‌ی تجسمی جدید رو براش توصیف کن (چطور رفتار می‌کنی؟ صدات چطوره؟ بدنت چطوره؟)",
      practice3:
        "برای اون صحنه، لنگر فیزیکی بساز:\n• لمس انگشتان\n• فشار کف دست\n• لمس سینه با تنفس عمیق",
      practice4: "این لنگر رو برای روزهای بعد و هر شب با تصویرسازی تمرین کن",
    },
    image: "/images/stress-day7.png",
  },
];
